; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	infrared0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation4 - direction
	Star6 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation3 - direction
	Star5 - direction
	Star2 - direction
	Star1 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 GroundStation7)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument9 infrared1)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument10 infrared1)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 Star2)
	(supports instrument11 infrared0)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 Star1)
	(supports instrument12 infrared1)
	(supports instrument12 infrared0)
	(calibration_target instrument12 Star1)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
)
(:goal (and
	(pointing satellite1 Star6)
	(pointing satellite3 Star2)
	(pointing satellite5 Phenomenon11)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 infrared1)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 infrared1)
	(have_image Planet13 thermograph2)
))

)

; plan
1. (turn_to satellite2 star0 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star0)
   goals met: 0 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite2 planet10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet10)
   goals met: 0 of 9
5. (take_image satellite2 planet10 instrument4 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon8 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon8 instrument4 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 9
9. (turn_to satellite1 star6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star6)
   goals met: 3 of 9
10. (take_image satellite2 phenomenon11 instrument4 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 4 of 9
11. (turn_to satellite2 planet13 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet13)
   goals met: 4 of 9
12. (take_image satellite2 planet13 instrument4 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 5 of 9
13. (turn_to satellite2 star12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star12)
   goals met: 5 of 9
14. (take_image satellite2 star12 instrument4 infrared1)
   added: (have_image star12 infrared1)
   goals met: 6 of 9
15. (turn_to satellite2 star9 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star9)
   goals met: 6 of 9
16. (take_image satellite2 star9 instrument4 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 9
17. (turn_to satellite3 star2 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star2)
   goals met: 8 of 9
18. (turn_to satellite5 phenomenon11 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 phenomenon11)
   goals met: 9 of 9
